# St7NewBrickProperty

Creates a new brick property.

long St7NewBrickProperty(long uID, long PropNum, long MaterialType,

char* PropName)

Input Parameters

uID

Strand7 model file ID.

PropNum

Brick property number.

MaterialType

One of mtIsotropic, mtOrthotropic, mtAnisotropic, mtRubber, mtSoil or mtFluid.

PropName

Name of the property.